; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph10 - mode
	infrared0 - mode
	thermograph2 - mode
	spectrograph7 - mode
	image5 - mode
	image3 - mode
	infrared9 - mode
	spectrograph6 - mode
	thermograph4 - mode
	spectrograph8 - mode
	infrared1 - mode
	spectrograph11 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 spectrograph11)
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph8)
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph6)
	(supports instrument0 infrared9)
	(supports instrument0 image3)
	(supports instrument0 image5)
	(supports instrument0 spectrograph7)
	(supports instrument0 thermograph2)
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph10)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
)
(:goal (and
	(have_image Planet6 thermograph2)
	(have_image Planet6 spectrograph7)
	(have_image Planet6 spectrograph10)
	(have_image Planet7 spectrograph6)
	(have_image Star8 image5)
	(have_image Star8 spectrograph11)
	(have_image Phenomenon9 spectrograph8)
	(have_image Phenomenon9 infrared0)
	(have_image Phenomenon9 infrared9)
	(have_image Phenomenon9 spectrograph7)
	(have_image Star10 spectrograph7)
	(have_image Star10 spectrograph8)
))

)

; plan
1. (turn_to satellite0 star5 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star5)
   goals met: 0 of 12
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
3. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 0 of 12
4. (turn_to satellite0 star10 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star10)
   goals met: 0 of 12
5. (take_image satellite0 star10 instrument0 spectrograph8)
   added: (have_image star10 spectrograph8)
   goals met: 1 of 12
6. (take_image satellite0 star10 instrument0 spectrograph7)
   added: (have_image star10 spectrograph7)
   goals met: 2 of 12
7. (turn_to satellite0 planet7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet7)
   goals met: 2 of 12
8. (take_image satellite0 planet7 instrument0 spectrograph6)
   added: (have_image planet7 spectrograph6)
   goals met: 3 of 12
9. (turn_to satellite0 phenomenon9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 12
10. (take_image satellite0 phenomenon9 instrument0 spectrograph8)
   added: (have_image phenomenon9 spectrograph8)
   goals met: 4 of 12
11. (take_image satellite0 phenomenon9 instrument0 spectrograph7)
   added: (have_image phenomenon9 spectrograph7)
   goals met: 5 of 12
12. (take_image satellite0 phenomenon9 instrument0 infrared9)
   added: (have_image phenomenon9 infrared9)
   goals met: 6 of 12
13. (take_image satellite0 phenomenon9 instrument0 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 7 of 12
14. (turn_to satellite0 planet6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet6)
   goals met: 7 of 12
15. (take_image satellite0 planet6 instrument0 spectrograph10)
   added: (have_image planet6 spectrograph10)
   goals met: 8 of 12
16. (take_image satellite0 planet6 instrument0 spectrograph7)
   added: (have_image planet6 spectrograph7)
   goals met: 9 of 12
17. (take_image satellite0 planet6 instrument0 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 10 of 12
18. (turn_to satellite0 star8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star8)
   goals met: 10 of 12
19. (take_image satellite0 star8 instrument0 image5)
   added: (have_image star8 image5)
   goals met: 11 of 12
20. (take_image satellite0 star8 instrument0 spectrograph11)
   added: (have_image star8 spectrograph11)
   goals met: 12 of 12
